----------------------------------------------- Dealing with Missing Values-----------------------------------------------------
Mising info in dataset leds to missing values
->if we feed this dataset to ML it will not accept it (gen erates error)
Ex:-
Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
1   34.0    12.0       2     NaN
2    NaN    56.0       5     5.0
3   15.0    95.0       6     6.0
4    NaN     NaN       9     9.0
5   65.0    30.0       8     8.0


#2 types of missing values:-
np.nan(not a number)
none

#Techniques to fill data:-
1.fillna [forward /backward fill]
2.replace 
3.interpolate [filling null value with avg of above and below value]
4.dropna [removing null values completely]

Identifying null values

In [1]:
import numpy as np
import pandas as pd

In [3]:
d={"Apple":[45,34,np.nan,15,np.nan,65],
  "Orange":[34,12,56,95,np.nan,30],
  "Grapes":[1,2,5,6,9,8],
 "Papaya":[10,np.nan,5,6,9,8]
}#np.nan refers to khali space not even 0
d

{'Apple': [45, 34, nan, 15, nan, 65],
 'Orange': [34, 12, 56, 95, nan, 30],
 'Grapes': [1, 2, 5, 6, 9, 8],
 'Papaya': [10, nan, 5, 6, 9, 8]}

In [5]:
df=pd.DataFrame(d)
df

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
1   34.0    12.0       2     NaN
2    NaN    56.0       5     5.0
3   15.0    95.0       6     6.0
4    NaN     NaN       9     9.0
5   65.0    30.0       8     8.0

In [6]:
#isnull() function:- return the result in True/False
df.isnull()

   Apple  Orange  Grapes  Papaya
0  False   False   False   False
1  False   False   False    True
2   True   False   False   False
3  False   False   False   False
4   True    True   False   False
5  False   False   False   False

In [9]:
#isnull().sum() function:- return the no of null values in respective columns
df.isnull().sum()

Apple     2
Orange    1
Grapes    0
Papaya    1
dtype: int64

In [11]:
#notnull() function
df.notnull()

   Apple  Orange  Grapes  Papaya
0   True    True    True    True
1   True    True    True   False
2  False    True    True    True
3   True    True    True    True
4  False   False    True    True
5   True    True    True    True

In [12]:
#notnull().sum()
df.notnull().sum()

Apple     4
Orange    5
Grapes    6
Papaya    5
dtype: int64

Handling null values

In [18]:
#1.fillna -> better for small dataset but not for large
df.fillna(0)

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
1   34.0    12.0       2     0.0
2    0.0    56.0       5     5.0
3   15.0    95.0       6     6.0
4    0.0     0.0       9     9.0
5   65.0    30.0       8     8.0

In [19]:
df.fillna(100)

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
1   34.0    12.0       2   100.0
2  100.0    56.0       5     5.0
3   15.0    95.0       6     6.0
4  100.0   100.0       9     9.0
5   65.0    30.0       8     8.0

In [20]:
#deprecated way but do same as bfill()
df.fillna(method="pad")

C:\Users\hp\AppData\Local\Temp\ipykernel_24852\4167762737.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="pad")

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
1   34.0    12.0       2    10.0
2   34.0    56.0       5     5.0
3   15.0    95.0       6     6.0
4   15.0    95.0       9     9.0
5   65.0    30.0       8     8.0

In [21]:
df.ffill()  #pichliyan values agge on giyan

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
1   34.0    12.0       2    10.0
2   34.0    56.0       5     5.0
3   15.0    95.0       6     6.0
4   15.0    95.0       9     9.0
5   65.0    30.0       8     8.0

In [22]:
df.bfill()  #agliyan values piche on giyan

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
1   34.0    12.0       2     5.0
2   15.0    56.0       5     5.0
3   15.0    95.0       6     6.0
4   65.0    30.0       9     9.0
5   65.0    30.0       8     8.0

In [23]:
d={"Apple":[45,34,np.nan,15,np.nan,65],
  "Orange":[34,12,56,95,np.nan,30],
  "Grapes":[1,2,5,6,9,8],
 "Papaya":[np.nan,np.nan,5,6,9,8]
}#np.nan refers to khali space not even 0
d

{'Apple': [45, 34, nan, 15, nan, 65],
 'Orange': [34, 12, 56, 95, nan, 30],
 'Grapes': [1, 2, 5, 6, 9, 8],
 'Papaya': [nan, nan, 5, 6, 9, 8]}

In [27]:
df=pd.DataFrame(d)
df

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1     NaN
1   34.0    12.0       2     NaN
2    NaN    56.0       5     5.0
3   15.0    95.0       6     6.0
4    NaN     NaN       9     9.0
5   65.0    30.0       8     8.0

In [26]:
df.ffill()

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1     NaN
1   34.0    12.0       2     NaN
2   34.0    56.0       5     5.0
3   15.0    95.0       6     6.0
4   15.0    95.0       9     9.0
5   65.0    30.0       8     8.0

In [28]:
df.bfill()
#disadv -> if first and last row has nan values then all nan values cant be eliminated

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1     5.0
1   34.0    12.0       2     5.0
2   15.0    56.0       5     5.0
3   15.0    95.0       6     6.0
4   65.0    30.0       9     9.0
5   65.0    30.0       8     8.0

In [29]:
#replace fxn
df.replace(np.nan,45)

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    45.0
1   34.0    12.0       2    45.0
2   45.0    56.0       5     5.0
3   15.0    95.0       6     6.0
4   45.0    45.0       9     9.0
5   65.0    30.0       8     8.0

In [31]:
#interpolate->BEST 
print(df)
df.interpolate()
#value remains nan if above or below or both has nan

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1     NaN
1   34.0    12.0       2     NaN
2    NaN    56.0       5     5.0
3   15.0    95.0       6     6.0
4    NaN     NaN       9     9.0
5   65.0    30.0       8     8.0

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1     NaN
1   34.0    12.0       2     NaN
2   24.5    56.0       5     5.0
3   15.0    95.0       6     6.0
4   40.0    62.5       9     9.0
5   65.0    30.0       8     8.0

In [32]:
#we can drop columsn which has no effect on final output

In [33]:
df.dropna()  #by default works row-wise

   Apple  Orange  Grapes  Papaya
3   15.0    95.0       6     6.0
5   65.0    30.0       8     8.0

In [34]:
df #still df is not updated

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1     NaN
1   34.0    12.0       2     NaN
2    NaN    56.0       5     5.0
3   15.0    95.0       6     6.0
4    NaN     NaN       9     9.0
5   65.0    30.0       8     8.0

In [36]:
#for permanent changes 
df=df.dropna()
df

   Apple  Orange  Grapes  Papaya
3   15.0    95.0       6     6.0
5   65.0    30.0       8     8.0

In [37]:
d={"Apple":[45,34,np.nan,15,np.nan,65],
  "Orange":[34,12,56,95,np.nan,30],
  "Grapes":[1,2,5,6,9,8],
 "Papaya":[10,np.nan,5,6,9,8]
}
d

{'Apple': [45, 34, nan, 15, nan, 65],
 'Orange': [34, 12, 56, 95, nan, 30],
 'Grapes': [1, 2, 5, 6, 9, 8],
 'Papaya': [10, nan, 5, 6, 9, 8]}

In [38]:
df=pd.DataFrame(d)

In [43]:
#axis=0 for row-wise 
#we will get row which donot have nan val
print(df)
df.dropna(axis=0)

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
1   34.0    12.0       2     NaN
2    NaN    56.0       5     5.0
3   15.0    95.0       6     6.0
4    NaN     NaN       9     9.0
5   65.0    30.0       8     8.0

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
3   15.0    95.0       6     6.0
5   65.0    30.0       8     8.0

In [41]:
#axis=1 for columns
#we will get column which donot have nan val
print(df)
df.dropna(axis=1)

   Apple  Orange  Grapes  Papaya
0   45.0    34.0       1    10.0
1   34.0    12.0       2     NaN
2    NaN    56.0       5     5.0
3   15.0    95.0       6     6.0
4    NaN     NaN       9     9.0
5   65.0    30.0       8     8.0

   Grapes
0       1
1       2
2       5
3       6
4       9
5       8